In [1]:
import pandas as pd 
import lxml

In [4]:
df3=pd.read_excel("Book1.xlsx")

In [53]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
# Ans1. 
df3["no."]

0     4
1     8
2    15
3    16
4    23
5    42
Name: no., dtype: int64

Ouput
0     4
1     8
2    15
3    16
4    23
5    42
Name: no., dtype: int64

In [ ]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.
# Ans 2
mylist=[1,2,3,4,5,6,7,8,9,10]
my_series=pd.Series(mylist)
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [28]:
# Q3. Create a Pandas DataFrame that contains the following data:
# Ans 3
data={"Name":["Alice","Bob","Claire"],
       "Age":[25,30,27],
       "Gender":["Female","Male","Female"]}
df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [34]:
# # Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
# Ans 4 = dataframe is data in table format and in pandas. and the pandas.series is the part of the data frame and the single line 
# data is called in pandas is pandas series. and whole data is called dataframe.
# Exaple:
#     Ans 2 is the example of pandas.series and 
#     Ans 3 is the example of pandas Dataframe 
type(my_series) #Ans 2
# Output : pandas.core.frame.DataFrame
type(df) #Ans 3
# output : pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

In [40]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?
# Ans 5 head() and tail() this is for data top view and bottom view .

In [41]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# Ans 6=Series and DataFrame are mutable in nature, while Panel is considered deprecated and not recommended for use in new code.

In [50]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
# here i excuting data into a list 
name=["Alice","Mark","Anuj"] 
# list converting into the pandas series  
name=pd.Series(name)
age=[23,40,12]
age=pd.Series(age)
city=["India","New york","Paris"]
city=pd.Series(city)
# the data is merging to the data frame using dictonary and merging into the data frame in pandas 
data_frame={"Name":name,"City":city,"Age":age}
data_frame_h=pd.DataFrame(data_frame)
data_frame_h

    Name      City  Age
0  Alice     India   23
1   Mark  New york   40
2   Anuj     Paris   12

pandas.core.series.Series